## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform
[command]/home/runner/work/_temp/825f0eab-4899-48f3-a935-628f283bedae/terraform-bin show -no-color main.tfplan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.acr.azurerm_container_registry.acr will be updated in-place
  ~ resource "azurerm_container_registry" "acr" {
        id                            = "/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-velidaaks/providers/Microsoft.ContainerRegistry/registries/prodacrvelidaaks"
        name                          = "prodacrvelidaaks"
      ~ tags                          = {
            "application" = "velidaaks"
            "environment" = "prod"
            "location"    = "australiaeast"
            "owner"       = "willvelida"
            "sub"         = "MVP-sub"
          + "type"        = "POC"
        }
        # (18 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.aks.azurerm_kubernetes_cluster.aks will be updated in-place
  ~ resource "azurerm_kubernetes_cluster" "aks" {
        id                                  = "/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-velidaaks/providers/Microsoft.ContainerService/managedClusters/prod-velidaaks"
        name                                = "prod-velidaaks"
      ~ tags                                = {
            "application" = "velidaaks"
            "environment" = "prod"
            "location"    = "australiaeast"
            "owner"       = "willvelida"
            "sub"         = "MVP-sub"
          + "type"        = "POC"
        }
        # (40 unchanged attributes hidden)

      ~ default_node_pool {
            name                          = "default"
            tags                          = {}
            # (33 unchanged attributes hidden)

          - upgrade_settings {
              - drain_timeout_in_minutes      = 0 -> null
              - max_surge                     = "10%" -> null
              - node_soak_duration_in_minutes = 0 -> null
            }
        }

        # (7 unchanged blocks hidden)
    }

  # module.azure-monitor-workspace.azurerm_monitor_workspace.workspace will be updated in-place
  ~ resource "azurerm_monitor_workspace" "workspace" {
        id                                  = "/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-velidaaks/providers/Microsoft.Monitor/accounts/prod-amw-velidaaks"
        name                                = "prod-amw-velidaaks"
      ~ tags                                = {
            "application" = "velidaaks"
            "environment" = "prod"
            "location"    = "australiaeast"
            "owner"       = "willvelida"
            "sub"         = "MVP-sub"
          + "type"        = "POC"
        }
        # (6 unchanged attributes hidden)
    }

  # module.dapr-extension.azurerm_kubernetes_cluster_extension.ext will be created
  + resource "azurerm_kubernetes_cluster_extension" "ext" {
      + aks_assigned_identity = (known after apply)
      + cluster_id            = "/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-velidaaks/providers/Microsoft.ContainerService/managedClusters/prod-velidaaks"
      + current_version       = (known after apply)
      + extension_type        = "Microsoft.Dapr"
      + id                    = (known after apply)
      + name                  = "dapr"
      + release_namespace     = (known after apply)
      + release_train         = "Stable"
      + target_namespace      = (known after apply)
    }

  # module.grafana_admin_role.azurerm_role_assignment.role will be created
  + resource "azurerm_role_assignment" "role" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "5667d54a-8d63-4fab-87b9-1df5e5804189"
      + principal_type                   = "User"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Grafana Admin"
      + scope                            = "/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-velidaaks/providers/Microsoft.Dashboard/grafana/prod-grafana-velidaaks"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.managed-grafana.azurerm_dashboard_grafana.grafana will be updated in-place
  ~ resource "azurerm_dashboard_grafana" "grafana" {
        id                                     = "/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-velidaaks/providers/Microsoft.Dashboard/grafana/prod-grafana-velidaaks"
        name                                   = "prod-grafana-velidaaks"
      ~ tags                                   = {
            "application" = "velidaaks"
            "environment" = "prod"
            "location"    = "australiaeast"
            "owner"       = "willvelida"
            "sub"         = "MVP-sub"
          + "type"        = "POC"
        }
        # (12 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.resource-group.azurerm_resource_group.rg will be updated in-place
  ~ resource "azurerm_resource_group" "rg" {
        id         = "/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-velidaaks"
        name       = "rg-velidaaks"
      ~ tags       = {
            "application" = "velidaaks"
            "environment" = "prod"
            "location"    = "australiaeast"
            "owner"       = "willvelida"
            "sub"         = "MVP-sub"
          + "type"        = "POC"
        }
        # (2 unchanged attributes hidden)
    }

  # module.user_assigned_identity.azurerm_user_assigned_identity.msi will be updated in-place
  ~ resource "azurerm_user_assigned_identity" "msi" {
        id                  = "/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-velidaaks/providers/Microsoft.ManagedIdentity/userAssignedIdentities/prod-uai-velidaaks"
        name                = "prod-uai-velidaaks"
      ~ tags                = {
            "application" = "velidaaks"
            "environment" = "prod"
            "location"    = "australiaeast"
            "owner"       = "willvelida"
            "sub"         = "MVP-sub"
          + "type"        = "POC"
        }
        # (5 unchanged attributes hidden)
    }

Plan: 2 to add, 6 to change, 0 to destroy.
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A  ~ update in-place%0A%0ATerraform will perform the following actions:%0A%0A  # module.acr.azurerm_container_registry.acr will be updated in-place%0A  ~ resource "azurerm_container_registry" "acr" {%0A        id                            = "/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-velidaaks/providers/Microsoft.ContainerRegistry/registries/prodacrvelidaaks"%0A        name                          = "prodacrvelidaaks"%0A      ~ tags                          = {%0A            "application" = "velidaaks"%0A            "environment" = "prod"%0A            "location"    = "australiaeast"%0A            "owner"       = "willvelida"%0A            "sub"         = "MVP-sub"%0A          + "type"        = "POC"%0A        }%0A        # (18 unchanged attributes hidden)%0A%0A        # (1 unchanged block hidden)%0A    }%0A%0A  # module.aks.azurerm_kubernetes_cluster.aks will be updated in-place%0A  ~ resource "azurerm_kubernetes_cluster" "aks" {%0A        id                                  = "/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-velidaaks/providers/Microsoft.ContainerService/managedClusters/prod-velidaaks"%0A        name                                = "prod-velidaaks"%0A      ~ tags                                = {%0A            "application" = "velidaaks"%0A            "environment" = "prod"%0A            "location"    = "australiaeast"%0A            "owner"       = "willvelida"%0A            "sub"         = "MVP-sub"%0A          + "type"        = "POC"%0A        }%0A        # (40 unchanged attributes hidden)%0A%0A      ~ default_node_pool {%0A            name                          = "default"%0A            tags                          = {}%0A            # (33 unchanged attributes hidden)%0A%0A          - upgrade_settings {%0A              - drain_timeout_in_minutes      = 0 -> null%0A              - max_surge                     = "10%25" -> null%0A              - node_soak_duration_in_minutes = 0 -> null%0A            }%0A        }%0A%0A        # (7 unchanged blocks hidden)%0A    }%0A%0A  # module.azure-monitor-workspace.azurerm_monitor_workspace.workspace will be updated in-place%0A  ~ resource "azurerm_monitor_workspace" "workspace" {%0A        id                                  = "/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-velidaaks/providers/Microsoft.Monitor/accounts/prod-amw-velidaaks"%0A        name                                = "prod-amw-velidaaks"%0A      ~ tags                                = {%0A            "application" = "velidaaks"%0A            "environment" = "prod"%0A            "location"    = "australiaeast"%0A            "owner"       = "willvelida"%0A            "sub"         = "MVP-sub"%0A          + "type"        = "POC"%0A        }%0A        # (6 unchanged attributes hidden)%0A    }%0A%0A  # module.dapr-extension.azurerm_kubernetes_cluster_extension.ext will be created%0A  + resource "azurerm_kubernetes_cluster_extension" "ext" {%0A      + aks_assigned_identity = (known after apply)%0A      + cluster_id            = "/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-velidaaks/providers/Microsoft.ContainerService/managedClusters/prod-velidaaks"%0A      + current_version       = (known after apply)%0A      + extension_type        = "Microsoft.Dapr"%0A      + id                    = (known after apply)%0A      + name                  = "dapr"%0A      + release_namespace     = (known after apply)%0A      + release_train         = "Stable"%0A      + target_namespace      = (known after apply)%0A    }%0A%0A  # module.grafana_admin_role.azurerm_role_assignment.role will be created%0A  + resource "azurerm_role_assignment" "role" {%0A      + id                               = (known after apply)%0A      + name                             = (known after apply)%0A      + principal_id                     = "5667d54a-8d63-4fab-87b9-1df5e5804189"%0A      + principal_type                   = "User"%0A      + role_definition_id               = (known after apply)%0A      + role_definition_name             = "Grafana Admin"%0A      + scope                            = "/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-velidaaks/providers/Microsoft.Dashboard/grafana/prod-grafana-velidaaks"%0A      + skip_service_principal_aad_check = (known after apply)%0A    }%0A%0A  # module.managed-grafana.azurerm_dashboard_grafana.grafana will be updated in-place%0A  ~ resource "azurerm_dashboard_grafana" "grafana" {%0A        id                                     = "/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-velidaaks/providers/Microsoft.Dashboard/grafana/prod-grafana-velidaaks"%0A        name                                   = "prod-grafana-velidaaks"%0A      ~ tags                                   = {%0A            "application" = "velidaaks"%0A            "environment" = "prod"%0A            "location"    = "australiaeast"%0A            "owner"       = "willvelida"%0A            "sub"         = "MVP-sub"%0A          + "type"        = "POC"%0A        }%0A        # (12 unchanged attributes hidden)%0A%0A        # (2 unchanged blocks hidden)%0A    }%0A%0A  # module.resource-group.azurerm_resource_group.rg will be updated in-place%0A  ~ resource "azurerm_resource_group" "rg" {%0A        id         = "/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-velidaaks"%0A        name       = "rg-velidaaks"%0A      ~ tags       = {%0A            "application" = "velidaaks"%0A            "environment" = "prod"%0A            "location"    = "australiaeast"%0A            "owner"       = "willvelida"%0A            "sub"         = "MVP-sub"%0A          + "type"        = "POC"%0A        }%0A        # (2 unchanged attributes hidden)%0A    }%0A%0A  # module.user_assigned_identity.azurerm_user_assigned_identity.msi will be updated in-place%0A  ~ resource "azurerm_user_assigned_identity" "msi" {%0A        id                  = "/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-velidaaks/providers/Microsoft.ManagedIdentity/userAssignedIdentities/prod-uai-velidaaks"%0A        name                = "prod-uai-velidaaks"%0A      ~ tags                = {%0A            "application" = "velidaaks"%0A            "environment" = "prod"%0A            "location"    = "australiaeast"%0A            "owner"       = "willvelida"%0A            "sub"         = "MVP-sub"%0A          + "type"        = "POC"%0A        }%0A        # (5 unchanged attributes hidden)%0A    }%0A%0APlan: 2 to add, 6 to change, 0 to destroy.%0A
::debug::stderr: 
::debug::exitcode: 0
```
</details>